{"pages":[{"title":"关于我们","text":"简介「 Go技术栈 」是 「 搜云库技术团队 」独立运营的一个专注于Go技术栈的研究与知识分享的网站，网站覆盖 GoLang、前端、后端、区块链、容器化编程、分布式的Golang微服务编程、等技术栈，助力您成为有思想的Golang架构师，聊架构，聊职场、聊人生！ 联系我们邮箱：gostack@souyunku.com 微信公众号","link":"/about/index.html"}],"posts":[{"title":"资料索引","text":"交流社区中文社区 Go技术栈：个专注于Go技术栈的研究与知识分享的网站 Golang 中国：国内较早的 Go 社区，汇聚各类信息与服务 Study Golang：国内 Go 社区先驱，同样汇聚各类信息与服务 Revel 交流论坛：Revel 框架的中文社区 GoCN Forum：Go 语言爱好者中文交流论坛 英文社区 Go Forum：Go 语言爱好者英文交流论坛 golang-nuts 邮件列表：Go 语言官方指定邮件列表讨论区 Go+ 社区：Go 语言官方指定 G+ 社区 知识图谱 Go Knowledge Graph：Go 知识图谱 [推荐] 资料汇总官方文档 英文文档 中文文档 标准库中文版 Go指南 中文资料书籍： 《深入解析Go》 《Go实战开发》 《Go入门指南》 《Go语言标准库》 《Go Web 编程》 《Go语言博客实践》 《Go语言学习笔记》 教程： 《Go编程基础》 《Go Web基础》 《Go名库讲解》 《Go 命令教程》 翻译： 《Effective Go》 英文版 《The Way to Go》 中文版 《Learning Go》 中文版 《Learning Go》 英文版=&gt;中文版 微信公众号","link":"/2019/04/06/data-index/"},{"title":"install-golang","text":"学习Go语言的第一步当然是要先安装Go语言的环境，毕竟，没有这个环境咱们什么都做不了。但是在安装环境之前咱们先了解一下Go涉及到的环境变量。这里介绍几个比较常用的Go语言环境变量。 GOROOTGo的安装路径，windows默认安装在’c:/go’路径下，Linux/macos下默认安装在’~/go’路径下 GOPATHGo 语言源码文件、包文件和可执行文件的路径，换句话说，GOPATH指定的是存放项目相关的文件路径 GOOS电脑的操作系统标识。如Mac下为“darwin“，windows下为”windows“ GOARCH电脑的处理器架构，如386，arm或amd64 GOBIN编译文件的安装位置，默认$GOROOT/bin 下面开始今天的正题，安装Go环境 Go语言的安装过程跟Java安装的过程非常的类似，可以通过二进制发行版安装、源码安装、安装程序以及第三方工具进行安装比较常用的方式有通过二进制发行版安装、安装程序安装和第三方工具安装三种方式。源码安装需要各种各样的编译环境，所以动手能力不强以及兴趣不高的同学可以采用其他三种方式 官方下载路径Go语言是Google内部开发开源出来的语言，所以，官方网站：https://golang.org 同样由Google提供但是这个官方网站对国内的用户却不是那么友好，好在Google提供了国内能够访问的国内官网地址：https://go-zh.org/ 供国内用户使用一些Go语言想关的资料都可以从这里查到。但是该网站却没有提供下载链接，只是提供了下载网页的外链。所以咱们让然使用golang.cn域名下提供的下载链接 下载路径为 : https://golang.google.cn/dl/ 这里咱们只介绍通过二进制发行版、安装程序和第三方工具安装三种常用的方式，动手能力比较强的可以尝试着通过源码进行安装 通过二进制发行版安装Windows平台这里以64位操作系统举例 go最新版1.12.4下载链接：https://dl.google.com/go/go1.12.4.windows-amd64.zip 下载之后我们将其解压到默认的安装路径’C:\\go’目录下之后打开控制面板配置环境变量，将’C:\\go\\bin;’加入到Path的最前面，确定退出环境变量设置窗口。(如果环境变量不生效，可以尝试一下重启大法^_^) 在重新打开一个cmd终端，输入’go’,如果看到类似下面的内容，就说明安装成功啦，不相信的话可以执行下文的’hello world’。如果发现其他的，说明没有安装成功，可以检查一下环境变量的问题 123456789101112131415161718192021222324252627282930313233343536373839Go is a tool for managing Go source code.Usage: go command [arguments]The commands are: build compile packages and dependencies clean remove object files doc show documentation for package or symbol env print Go environment information fix run go tool fix on packages fmt run gofmt on package sources generate generate Go files by processing source get download and install packages and dependencies install compile and install packages and dependencies list list packages run compile and run Go program test test packages tool run specified go tool version print Go version vet run go tool vet on packagesUse &quot;go help [command]&quot; for more information about a command.Additional help topics: c calling between Go and C buildmode description of build modes filetype file types gopath GOPATH environment variable environment environment variables importpath import path syntax packages description of package lists testflag description of testing flags testfunc description of testing functionsUse &quot;go help [topic]&quot; for more information about that topic. Linux 平台这里以64位操作系统举例 go最新版1.12.4下载链接:https://dl.google.com/go/go1.12.4.linux-amd64.tar.gz 先将下载好的二进制发行版压缩包放解压到用户根目录，此时根目录中将会出现’go’文件夹，里面就是go所有的安装内容 linux下配置环境变量也相对简单一些 将以下命令添加到 $HOME/.profile 文件中执行一下’source $HOME/.profile’就可以了 1export PATH=$PATH:$HOME/go/bin 配置好环境变量，我们再输入’go’，出现上面成功的说明，即安装成功了 Mac平台通过二进制发行版安装的方式与Linux平台基本相同，下载二进制发行版压缩包，解压到用户根目录，配置环境变量。不过要注意下载Mac版本的安装包来安装哦 这里需要注意的是，咱们通过通过二进制发行版来安装的过程中均没有配置’GOROOT’,’GOPATH’等环境变量。这是因为咱们在安装的过程中，都是将Go安装在默认的位置，Windows的默认位置是’C:\\go’, MacOS和Linux的默认位置是’$HOME/go’。所以’GOROOT’使用的就是默认路径，’GOPATH’同样采用的是默认路径（用户的根目录），所以这里都是没问题的 第三方工具Mac平台和Linux平台的用户都会使用包管理器进行程序的管理，Windows平台好像并没有（如果有的话可以留言告知）Go语言同样可以通过包管理器进行安装，也是非常的方便 apt-getUbuntu是目前使用最多的Linux桌面系统，使用apt-get命令来管理软件包 我们可以通过下面的命令来安装Go 1sudo apt-get install golang 这里需要注意的是，apt提供的不是最新的Go版本，而且，直接通过’apt-get install golang’下载的go，版本可能还比较低，这时候咱们可以指定版本下载 1sudo apt-get install golang-1.10 Ubuntu16.04中 apt-get提供的最新的Go版本为1.10，不是Go发行的最新版，如果需要安装最新版，可参考其他安装方式 homebrewhomebrew是Mac系统下面目前使用最多的管理软件的工具，简称brew 目前brew已支持Go，可以通过命令直接安装Go 如果没有安装过brew可以参考brew官方文档：https://brew.sh 这里直接通过brew进行Go的安装，不再阐述brew的安装 12brew update &amp;&amp; brew upgradebrew install go 安装程序Windows和MacOS作为全球最大的桌面系统，Go同样提供了安装程序来帮助开发者，这样一来只需要通过鼠标进行简单的点击就能很快的安装好Go的环境 如果想通过这种方式进行安装，可以直接下载对应的安装程序点击运行即可 测试安装环境安装完成了，下面就可以进入咱们大家最熟悉的’Hello World’了 可以先将下面的内容拷贝到main.go的文档中，运行’go run main.go’测试。后续咱们再细聊该文件的结构1234567package mainimport &quot;fmt&quot;func main() { fmt.Println(&quot;Hello World&quot;)} 如果程序能正常运行，并正确输出’Hello World’，那恭喜你，Go语言环境安装已经成功了 微信公众号 首发微信公众号：Go技术栈，ID：GoStack 版权归作者所有，任何形式转载请联系作者。 作者：搜云库技术团队出处：https://gostack.souyunku.com/2019/04/15/install-golang","link":"/2019/04/15/install-golang/"},{"title":"study_golang_with_us","text":"搜云库技术团队从事于Java相关领域多年，拥有Java语言技术丰富的从业经验，涉猎AI、Python、Java、Android、iOS、Golang、前端、后端、大数据、人工智能等，我们的目标也是致力于营造一个覆盖全栈的学习分享的技术社群。区块链、云计算以及微服务等技术近年来风靡全球，现如今如果说不知道区块链是什么的人，在这个行业中的感觉都会比人家低人一等。大家所熟知的公有链以太坊、联盟链Hyperledger Fabric，甚至是云计算必用的容器化技术docker，都是使用Go语言来实现的。 借着这股技术浪潮，我们新开「Go技术栈」这个公众号，目的在于分享Go语言相关领域的学习过程，让更多的人能够了解区块链、云计算、微服务等前沿技术并能对其有一定程度的认知与掌握。能够向更高薪的岗位挑战。 关注我们能获得什么「Go技术栈」不仅仅包含丰富的书籍和清晰明了的学习路线，内容丰富的4T学习资源视频，还有多个微信技术交流群（近4000人），供大家进行技术讨论，无论有没有相关经验都能轻松驾驭新技术。 一线城市的工作内推群、北、上、广、深、杭、成、武、南、郑、西，工作内推群，帮助大家找到理想的工作，来体现各位的价值。 关注我们，不仅能利用有限的时间学习无限的知识，还能在通往高薪未来的道路上少走弯路。 公号后台回复关键字： 「1024」可获得 4T 学习资源视频 「2048」可获得 Golang 学习路线 「内推」 可进群 一线城市内推群 公众号的目标读者人群人生充满迷茫的小白不知道如何选择，又想要获得高薪？如果你自制力强、学习态度好、又能坚持，那「Go技术栈」非常适合你，我们会为你提供由浅入深的学习计划，小到Go工具集，大到区块链、云计算，我们都会涉及到。 有一定经验的开发工程师有一定的开发经验，或许技术发展受限，想着多学习一门技术拓宽自己的未来发展，看好区块链、云计算等热门行业。那么选择「Go技术栈」，说明你找对地方了。 运维人员常年从事运维工作，整天与服务器打交道，想着学习开发。那简直太好了，「Go技术栈」会涉及到容器化技术相关的知识，又会从基础做起。做运维开发，没问题。 志向远大的全能型人才听说你想独立开发，自己搞定前端后端运维等一整套的工作？那Go语言简直太适合你了。偷偷告诉你，「Go技术栈」，这些技术都会涵盖到。 加油吧少年就这么多？不，Go语言能做的还很多。「Go技术栈」能做的也很多。 漫漫学习路，搜云库技术团队愿与您携手同行，踏向征服Go语言的仕途。 微信公众号","link":"/2019/04/11/study-golang-with-us/"}],"tags":[{"name":"学习资料","slug":"学习资料","link":"/tags/学习资料/"},{"name":"GoLang","slug":"GoLang","link":"/tags/GoLang/"}],"categories":[{"name":"资料索引","slug":"资料索引","link":"/categories/资料索引/"}]}